; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	thermograph2 - mode
	image4 - mode
	image6 - mode
	infrared3 - mode
	infrared7 - mode
	image0 - mode
	thermograph5 - mode
	spectrograph1 - mode
	GroundStation4 - direction
	GroundStation2 - direction
	Star1 - direction
	GroundStation0 - direction
	Star5 - direction
	Star3 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet11)
	(supports instrument1 infrared7)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 Star1)
	(supports instrument2 image4)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument3 image0)
	(supports instrument3 thermograph5)
	(supports instrument3 image4)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 Star5)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
	(supports instrument4 thermograph2)
	(supports instrument4 image6)
	(calibration_target instrument4 GroundStation0)
	(calibration_target instrument4 Star1)
	(supports instrument5 infrared7)
	(supports instrument5 infrared3)
	(calibration_target instrument5 Star3)
	(calibration_target instrument5 Star5)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star9)
)
(:goal (and
	(pointing satellite0 Star9)
	(pointing satellite2 GroundStation4)
	(have_image Phenomenon6 thermograph5)
	(have_image Phenomenon7 thermograph2)
	(have_image Phenomenon7 spectrograph1)
	(have_image Star8 thermograph5)
	(have_image Star8 thermograph2)
	(have_image Star9 thermograph2)
	(have_image Star9 spectrograph1)
	(have_image Phenomenon10 spectrograph1)
	(have_image Phenomenon10 thermograph5)
	(have_image Planet11 spectrograph1)
	(have_image Planet11 infrared3)
	(have_image Star12 image4)
	(have_image Star12 spectrograph1)
))

)

; plan
1. (turn_to satellite3 star3 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 star3)
   goals met: 0 of 15
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 15
3. (calibrate satellite3 instrument5 star3)
   added: (calibrated instrument5)
   goals met: 0 of 15
4. (turn_to satellite3 planet11 star3)
   deleted: (pointing satellite3 star3)
   added: (pointing satellite3 planet11)
   goals met: 0 of 15
5. (take_image satellite3 planet11 instrument5 infrared3)
   added: (have_image planet11 infrared3)
   goals met: 1 of 15
6. (turn_to satellite3 groundstation0 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 groundstation0)
   goals met: 1 of 15
7. (turn_to satellite2 star3 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 star3)
   goals met: 1 of 15
8. (turn_to satellite0 groundstation0 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 groundstation0)
   goals met: 1 of 15
9. (switch_off instrument5 satellite3)
   deleted: (power_on instrument5)
   added: (power_avail satellite3)
   goals met: 1 of 15
10. (switch_on instrument4 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument4)
   goals met: 1 of 15
11. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 1 of 15
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 15
13. (calibrate satellite3 instrument4 groundstation0)
   added: (calibrated instrument4)
   goals met: 1 of 15
14. (calibrate satellite2 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 1 of 15
15. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 1 of 15
16. (turn_to satellite0 phenomenon10 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon10)
   goals met: 1 of 15
17. (take_image satellite0 phenomenon10 instrument0 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   goals met: 2 of 15
18. (turn_to satellite0 phenomenon7 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon7)
   goals met: 2 of 15
19. (take_image satellite0 phenomenon7 instrument0 spectrograph1)
   added: (have_image phenomenon7 spectrograph1)
   goals met: 3 of 15
20. (turn_to satellite0 planet11 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet11)
   goals met: 3 of 15
21. (take_image satellite0 planet11 instrument0 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 4 of 15
22. (turn_to satellite0 star12 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star12)
   goals met: 4 of 15
23. (take_image satellite0 star12 instrument0 spectrograph1)
   added: (have_image star12 spectrograph1)
   goals met: 5 of 15
24. (turn_to satellite0 star9 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star9)
   goals met: 6 of 15
25. (take_image satellite0 star9 instrument0 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 7 of 15
26. (turn_to satellite2 phenomenon10 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 phenomenon10)
   goals met: 7 of 15
27. (take_image satellite2 phenomenon10 instrument3 thermograph5)
   added: (have_image phenomenon10 thermograph5)
   goals met: 8 of 15
28. (turn_to satellite2 phenomenon6 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 phenomenon6)
   goals met: 8 of 15
29. (take_image satellite2 phenomenon6 instrument3 thermograph5)
   added: (have_image phenomenon6 thermograph5)
   goals met: 9 of 15
30. (turn_to satellite2 star12 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 star12)
   goals met: 9 of 15
31. (take_image satellite2 star12 instrument3 image4)
   added: (have_image star12 image4)
   goals met: 10 of 15
32. (turn_to satellite2 star8 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 star8)
   goals met: 10 of 15
33. (take_image satellite2 star8 instrument3 thermograph5)
   added: (have_image star8 thermograph5)
   goals met: 11 of 15
34. (turn_to satellite2 groundstation4 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 groundstation4)
   goals met: 12 of 15
35. (turn_to satellite3 phenomenon7 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 phenomenon7)
   goals met: 12 of 15
36. (take_image satellite3 phenomenon7 instrument4 thermograph2)
   added: (have_image phenomenon7 thermograph2)
   goals met: 13 of 15
37. (turn_to satellite3 star8 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 star8)
   goals met: 13 of 15
38. (take_image satellite3 star8 instrument4 thermograph2)
   added: (have_image star8 thermograph2)
   goals met: 14 of 15
39. (turn_to satellite3 star9 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 star9)
   goals met: 14 of 15
40. (take_image satellite3 star9 instrument4 thermograph2)
   added: (have_image star9 thermograph2)
   goals met: 15 of 15
